app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "created_at", "job_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asd"], ["created_at", Thu, 20 Mar 2014 13:44:01 UTC +00:00], ["job_id", 3], ["name", "asda"], ["updated_at", Thu, 20 Mar 2014 13:44:01 UTC +00:00]]
---
    <%= simple_format comment.body %>
    Sent <%= t ".send", timestamp: time_ago_in_words(comment.created_at) %> ago