app/views/jobs/_job.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."job_id" = 1
---
<p>
  <%= pluralize(job.comments.size, "comment") %> |