app/views/jobs/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."job_id" = 5
---
<p>
  <%= pluralize(@job.comments.size, t("comments.count")) %> |