app/controllers/comments_controller.rb

  def create
    @job = Job.find(params[:job_id])
    @comment = @job.comments.build(params[:comment])

    if success = @comment.save
---
INSERT INTO "comments" ("body", "created_at", "job_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "i want this job"], ["created_at", Tue, 11 Mar 2014 23:50:59 UTC +00:00], ["job_id", 3], ["name", "Bruno"], ["updated_at", Tue, 11 Mar 2014 23:50:59 UTC +00:00]]