app/controllers/companies_controller.rb

	def create
		@company = Company.new(params[:company])

		if @company.save
---
INSERT INTO "companies" ("created_at", "email", "encrypted_password", "name", "updated_at") VALUES (?, ?, ?, ?, ?)