app/controllers/jobs_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 2 LIMIT 1
---
  def index
    @id_minimo = params[:id_minimo]
    id @id_minimo
      lista_parcial = Job.where("id > ?", @id_minimo)
    else
      lista_parcial = Job
    end
    @job = lista_parcial.most_recent.includes(:company).all

SELECT "companies".* FROM "companies" WHERE "companies"."id" IN (4)
---
  def premium
    @jobs = Job.where(premium: true).includes(:company).most_recent.
      paginate(page: params[:page], per_page: 10)